app/Http/Controllers/ReportController.php

select * from `ships` where `ships`.`id` = 1 limit 1
select * from `hazmats` where `hazmats`.`id` in (1)
select * from `po_order_items_hazmats` where `ship_id` = 1 and `ihm_table_type` is not null
select * from `previous_attachments` where `ship_id` = 1
---
    public function reportCenter(Request $request)
    {
        $user = Auth::user();

        $ship_id = $user->shipClient->id;
        $ship = Ship::find($ship_id);
        $partMenual = partManuel::where('ship_id', operator: $ship_id)->get();
        $checkHazmatIHMPart = PoOrderItemsHazmats::with(relations: 'hazmat')->where('ship_id', $ship_id)->whereNotNull('ihm_table_type')->get();
        $previousAttachment = PreviousAttachment::where('ship_id', $ship_id)->get();