app/Http/Controllers/ShipController.php

    public function index(request $request)
    {
        $user = Auth::user();
        $currentUserRoleLevel = $user->roles->first()->level;

        if ($currentUserRoleLevel == 3 || $currentUserRoleLevel == 4) {
            $ships = $user->ships->load('client');
        } else {
            $shipsQuery = Ship::with('client', 'hazmatComapny');
            if ($request->has('search')) {
                $search = $request->search;
                $shipsQuery->where(function ($query) use ($search) {
                    $query->where('ship_name', 'like', '%' . $search . '%')
                        ->orWhere('imo_number', 'like', '%' . $search . '%');
                });
            }
            $shipsQuery->when($currentUserRoleLevel == 2, function ($query) use ($user) {
                return $query->where('hazmat_companies_id', $user['hazmat_companies_id']);
            });

            $shipsQuery->when($currentUserRoleLevel == 5, function ($query) use ($user) {
                return $query->where('hazmat_companies_id', $user['hazmat_companies_id'])
                    ->where('client_user_id', $user['id']);
            });

            $shipsQuery->when($currentUserRoleLevel == 6, function ($query) use ($user) {
                return $query->where('hazmat_companies_id', $user['hazmat_companies_id'])
                    ->where('user_id', $user['id']);
            });
            $ships = $shipsQuery->paginate(8);
---
select * from `ships` limit 8 offset 0
select count(*) as aggregate from `ships`